results/data/run2/native-static/erik-laptop/quarkus-io-thread-20000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.592ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.765ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.788ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.726ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.74ms  841.40us   8.62ms   66.07%
    Req/Sec     5.29k   551.41     8.33k    87.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.47ms
 75.000%    2.35ms
 90.000%    3.07ms
 99.000%    3.69ms
 99.900%    5.02ms
 99.990%    7.41ms
 99.999%    8.15ms
100.000%    8.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.252     0.000000            1         1.00
       0.874     0.100000        99882         1.11
       1.052     0.200000       199517         1.25
       1.199     0.300000       299618         1.43
       1.338     0.400000       399027         1.67
       1.469     0.500000       499032         2.00
       1.544     0.550000       548734         2.22
       1.634     0.600000       598905         2.50
       1.746     0.650000       648554         2.86
       1.931     0.700000       698250         3.33
       2.353     0.750000       748156         4.00
       2.607     0.775000       773120         4.44
       2.729     0.800000       798449         5.00
       2.817     0.825000       822967         5.71
       2.897     0.850000       848518         6.67
       2.977     0.875000       873068         8.00
       3.021     0.887500       885527         8.89
       3.069     0.900000       897995        10.00
       3.115     0.912500       910257        11.43
       3.167     0.925000       922695        13.33
       3.227     0.937500       935406        16.00
       3.261     0.943750       941639        17.78
       3.297     0.950000       947905        20.00
       3.333     0.956250       954121        22.86
       3.371     0.962500       960203        26.67
       3.417     0.968750       966371        32.00
       3.443     0.971875       969450        35.56
       3.473     0.975000       972577        40.00
       3.511     0.978125       975731        45.71
       3.555     0.981250       978894        53.33
       3.601     0.984375       981978        64.00
       3.625     0.985938       983595        71.11
       3.649     0.987500       985106        80.00
       3.673     0.989062       986691        91.43
       3.699     0.990625       988222       106.67
       3.727     0.992188       989758       128.00
       3.743     0.992969       990551       142.22
       3.761     0.993750       991301       160.00
       3.785     0.994531       992080       182.86
       3.819     0.995313       992858       213.33
       3.869     0.996094       993625       256.00
       3.905     0.996484       994001       284.44
       3.955     0.996875       994397       320.00
       4.015     0.997266       994776       365.71
       4.135     0.997656       995168       426.67
       4.331     0.998047       995552       512.00
       4.447     0.998242       995750       568.89
       4.575     0.998437       995942       640.00
       4.723     0.998633       996137       731.43
       4.895     0.998828       996336       853.33
       5.047     0.999023       996526      1024.00
       5.127     0.999121       996627      1137.78
       5.211     0.999219       996723      1280.00
       5.327     0.999316       996821      1462.86
       5.523     0.999414       996916      1706.67
       5.795     0.999512       997013      2048.00
       6.159     0.999561       997062      2275.56
       6.575     0.999609       997111      2560.00
       6.867     0.999658       997162      2925.71
       6.971     0.999707       997208      3413.33
       7.079     0.999756       997258      4096.00
       7.119     0.999780       997285      4551.11
       7.183     0.999805       997306      5120.00
       7.247     0.999829       997330      5851.43
       7.295     0.999854       997355      6826.67
       7.363     0.999878       997381      8192.00
       7.391     0.999890       997391      9102.22
       7.419     0.999902       997405     10240.00
       7.455     0.999915       997415     11702.86
       7.519     0.999927       997427     13653.33
       7.579     0.999939       997440     16384.00
       7.615     0.999945       997447     18204.44
       7.659     0.999951       997452     20480.00
       7.695     0.999957       997461     23405.71
       7.723     0.999963       997465     27306.67
       7.755     0.999969       997471     32768.00
       7.775     0.999973       997473     36408.89
       7.799     0.999976       997476     40960.00
       7.867     0.999979       997479     46811.43
       7.887     0.999982       997482     54613.33
       7.975     0.999985       997485     65536.00
       7.991     0.999986       997487     72817.78
       8.055     0.999988       997488     81920.00
       8.151     0.999989       997490     93622.86
       8.167     0.999991       997491    109226.67
       8.179     0.999992       997493    131072.00
       8.187     0.999993       997494    145635.56
       8.187     0.999994       997494    163840.00
       8.215     0.999995       997495    187245.71
       8.271     0.999995       997496    218453.33
       8.359     0.999996       997497    262144.00
       8.359     0.999997       997497    291271.11
       8.359     0.999997       997497    327680.00
       8.527     0.999997       997498    374491.43
       8.527     0.999998       997498    436906.67
       8.615     0.999998       997499    524288.00
       8.615     0.999998       997499    582542.22
       8.615     0.999998       997499    655360.00
       8.615     0.999999       997499    748982.86
       8.615     0.999999       997499    873813.33
       8.623     0.999999       997500   1048576.00
       8.623     1.000000       997500          inf
#[Mean    =        1.740, StdDeviation   =        0.841]
#[Max     =        8.616, Total count    =       997500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1198825 requests in 1.00m, 83.46MB read
Requests/sec:  19979.79
Transfer/sec:      1.39MB