results/data/run2/native-static/erik-laptop/quarkus-worker-pool-38000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 129.796ms, rate sampling interval: 455ms
  Thread calibration: mean lat.: 151.783ms, rate sampling interval: 564ms
  Thread calibration: mean lat.: 175.372ms, rate sampling interval: 604ms
  Thread calibration: mean lat.: 132.508ms, rate sampling interval: 482ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   955.12ms  652.03ms   3.17s    69.52%
    Req/Sec     9.23k   714.68    10.97k    66.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  817.66ms
 75.000%    1.34s 
 90.000%    1.82s 
 99.000%    2.89s 
 99.900%    3.07s 
 99.990%    3.13s 
 99.999%    3.15s 
100.000%    3.17s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.265     0.000000            1         1.00
     230.399     0.100000       183754         1.11
     366.847     0.200000       367344         1.25
     516.863     0.300000       550921         1.43
     680.959     0.400000       735033         1.67
     817.663     0.500000       918468         2.00
     892.415     0.550000      1010185         2.22
     991.231     0.600000      1101920         2.50
    1110.015     0.650000      1193840         2.86
    1223.679     0.700000      1285836         3.33
    1335.295     0.750000      1377261         4.00
    1402.879     0.775000      1423513         4.44
    1475.583     0.800000      1469461         5.00
    1545.215     0.825000      1515317         5.71
    1628.159     0.850000      1561115         6.67
    1718.271     0.875000      1607034         8.00
    1762.303     0.887500      1629817         8.89
    1817.599     0.900000      1652848        10.00
    1895.423     0.912500      1675747        11.43
    1984.511     0.925000      1698560        13.33
    2119.679     0.937500      1721575        16.00
    2185.215     0.943750      1732962        17.78
    2269.183     0.950000      1744597        20.00
    2363.391     0.956250      1756123        22.86
    2449.407     0.962500      1767379        26.67
    2586.623     0.968750      1778928        32.00
    2658.303     0.971875      1784635        35.56
    2717.695     0.975000      1790434        40.00
    2762.751     0.978125      1796179        45.71
    2795.519     0.981250      1801884        53.33
    2826.239     0.984375      1807713        64.00
    2842.623     0.985938      1810638        71.11
    2859.007     0.987500      1813443        80.00
    2877.439     0.989062      1816389        91.43
    2895.871     0.990625      1819201       106.67
    2916.351     0.992188      1822083       128.00
    2926.591     0.992969      1823401       142.22
    2938.879     0.993750      1824862       160.00
    2953.215     0.994531      1826344       182.86
    2967.551     0.995313      1827720       213.33
    2981.887     0.996094      1829140       256.00
    2990.079     0.996484      1829867       284.44
    2998.271     0.996875      1830587       320.00
    3006.463     0.997266      1831282       365.71
    3014.655     0.997656      1831925       426.67
    3026.943     0.998047      1832731       512.00
    3033.087     0.998242      1833063       568.89
    3039.231     0.998437      1833374       640.00
    3047.423     0.998633      1833766       731.43
    3055.615     0.998828      1834085       853.33
    3065.855     0.999023      1834439      1024.00
    3071.999     0.999121      1834645      1137.78
    3078.143     0.999219      1834832      1280.00
    3082.239     0.999316      1834971      1462.86
    3088.383     0.999414      1835173      1706.67
    3094.527     0.999512      1835351      2048.00
    3098.623     0.999561      1835468      2275.56
    3100.671     0.999609      1835524      2560.00
    3104.767     0.999658      1835614      2925.71
    3108.863     0.999707      1835710      3413.33
    3112.959     0.999756      1835800      4096.00
    3115.007     0.999780      1835848      4551.11
    3117.055     0.999805      1835891      5120.00
    3119.103     0.999829      1835932      5851.43
    3121.151     0.999854      1835969      6826.67
    3123.199     0.999878      1836003      8192.00
    3125.247     0.999890      1836032      9102.22
    3127.295     0.999902      1836057     10240.00
    3129.343     0.999915      1836080     11702.86
    3131.391     0.999927      1836106     13653.33
    3133.439     0.999939      1836126     16384.00
    3133.439     0.999945      1836126     18204.44
    3135.487     0.999951      1836139     20480.00
    3137.535     0.999957      1836152     23405.71
    3139.583     0.999963      1836165     27306.67
    3141.631     0.999969      1836179     32768.00
    3141.631     0.999973      1836179     36408.89
    3143.679     0.999976      1836186     40960.00
    3143.679     0.999979      1836186     46811.43
    3145.727     0.999982      1836192     54613.33
    3147.775     0.999985      1836197     65536.00
    3149.823     0.999986      1836203     72817.78
    3149.823     0.999988      1836203     81920.00
    3151.871     0.999989      1836207     93622.86
    3153.919     0.999991      1836213    109226.67
    3153.919     0.999992      1836213    131072.00
    3153.919     0.999993      1836213    145635.56
    3155.967     0.999994      1836216    163840.00
    3155.967     0.999995      1836216    187245.71
    3158.015     0.999995      1836217    218453.33
    3160.063     0.999996      1836218    262144.00
    3162.111     0.999997      1836219    291271.11
    3164.159     0.999997      1836221    327680.00
    3164.159     0.999997      1836221    374491.43
    3164.159     0.999998      1836221    436906.67
    3166.207     0.999998      1836222    524288.00
    3166.207     0.999998      1836222    582542.22
    3168.255     0.999998      1836223    655360.00
    3168.255     0.999999      1836223    748982.86
    3168.255     0.999999      1836223    873813.33
    3170.303     0.999999      1836225   1048576.00
    3170.303     1.000000      1836225          inf
#[Mean    =      955.124, StdDeviation   =      652.028]
#[Max     =     3168.256, Total count    =      1836225]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2207225 requests in 1.00m, 183.13MB read
Requests/sec:  36768.43
Transfer/sec:      3.05MB